{
    "columns": [
        "Term",
        "Definition"
    ],
    "rows": [
        [
            "Achene",
            "A small, seed-like, indehiscent dry fruit"
        ],
        [
            "Actinomorphic",
            "An adjective describing radially-symmetric flowers; i.e., flowers with more than one plane of symmetry"
        ],
        [
            "Aggregate fruits",
            "Clusters of several to many individual berries, follicles, or samaras derived from multiple separate pistils of a single flower"
        ],
        [
            "Alternate leaves",
            "A leaf arrangement in which leaves are arranged singly, one leaf per nod, alternating on either side of the stem"
        ],
        [
            "Annual growth increment",
            "The length of twig between two sets of bud scale scars, or between the terminal bud and a set of bud scale scars"
        ],
        [
            "Anther",
            "The pollen-producing part of the stamen"
        ],
        [
            "Appendages",
            "Appendages (e.g. leaves and bracts) are produced along axes, and grow to a fixed size and shape, in characteristic patterns of arrangement"
        ],
        [
            "Appressed",
            "An adjective describing a structure which lies flat (e.g hairs)"
        ],
        [
            "Aril",
            "A fleshy, usually colourful outgrowth of a seed stalk that (at least partially) surrounds the seed and contributes to attractiveness for animal dispersal"
        ],
        [
            "Axis",
            "Axes are the trunks of trees, individual stems, branches, or twigs, all of which typically continue to grow in length from a bud at the tip"
        ],
        [
            "Axil (of a leaf)",
            "The position in the angle formed between the stem and the upper side of the leaf stalk"
        ],
        [
            "Axillary (lateral) buds",
            "Buds found in the axil of a leaf"
        ],
        [
            "Bark types",
            "TODO: requires images"
        ],
        [
            "Berry",
            "A fleshy, one- to many-seeded fruit derived from one or many carpels, with divisions that equal the number of carpels"
        ],
        [
            "Bipinnate leaves",
            "A compound leaf which is twice pinnate; i.e., leaflets are arranged along rachillae, which are themselves arranged along the rachis"
        ],
        [
            "Bisexual flowers",
            "Flowers containing both male and female reproductive organs. Bisexual plants are neither monoecious nor dioecious"
        ],
        [
            "Bloom (noun)",
            "A whitish powdery deposit or coating, as on the surface of certain fruits and leaves"
        ],
        [
            "Bract",
            "A modified or specialized leaf associated with a reproductive structure such as a flower, inflorescence, or cone scale"
        ],
        [
            "Bracteate/bracteolate",
            "An adjective describing plants having bracts"
        ],
        [
            "Bracteoles",
            "Small bracts associated with individual flowers in a cluster"
        ],
        [
            "Broadleaved",
            "An adjective describing a plant with wide, flat leaves. There are two types of broad leaves: simple and compound"
        ],
        [
            "Bud",
            "An undeveloped or embryonic shoot"
        ],
        [
            "Bud scales",
            "Scale-like modified leaves that protect the lateral and terminal buds"
        ],
        [
            "Bud scale scars",
            "Scars surrounding the twig, which are left by the previous year's terminal bud"
        ],
        [
            "Bundle scars",
            "Smaller markings within a leaf scar left by vascular bundle connections between the leaf and the twig"
        ],
        [
            "Calyx (pl. calyces)",
            "The collective name for the sepals, which may all be free from one another or form a tube"
        ],
        [
            "Capsule",
            "A dehiscent dry fruit derived from a compound ovary that opens along one or more sutures"
        ],
        [
            "Carpel",
            "A single, ovule-bearing unit, sometimes having individual ovaries and sometimes connecting to a shared basal ovary"
        ],
        [
            "Catkin",
            "A spike of unisexual flowers"
        ],
        [
            "Compound leaves",
            "A type of broad leaf divided into separate blades called leaflets"
        ],
        [
            "Corolla",
            "The collective name for the petals, which may all be free from one another or form a tube"
        ],
        [
            "Corymb",
            "A type of flower cluster in which the lower stalks are proportionally longer so that the flowers form a flat or slightly convex head"
        ],
        [
            "Crown",
            "The upper leafy portion of a tree"
        ],
        [
            "Crown shapes",
            "TODO: requires images"
        ],
        [
            "Dehiscent dry fruits",
            "Fruits which split open to release their seeds"
        ],
        [
            "Dioecy (adj. dioecious)",
            "A sexual system in seed plants where distinct unisexual individuals produce either male or female gametes"
        ],
        [
            "Drupe",
            "A fleshy or leathery fruit in which the innermost layer of the ovary wall is hardened into a stone or stones"
        ],
        [
            "Dry fruits",
            "Fruits which have a hard, dry pericarp around their seeds, where the exocarp, mesocarp, and endocarp aren't clearly distinguishable"
        ],
        [
            "Ebracteate/ebracteolate",
            "An adjective describing plants lacking bracts"
        ],
        [
            "Endocarp",
            "The innermost layer of the pericarp which surrounds a seed in a fruit"
        ],
        [
            "Exocarp",
            "The outer layer of the pericarp of a fruit"
        ],
        [
            "Facial pair",
            "The pairs of leaves on the upper and lower surfaces in a flattened foliage spray"
        ],
        [
            "Filament",
            "The stalk of the anther"
        ],
        [
            "Fleshy/succulent fruits",
            "Fruits with a fleshy pericarp around their seeds"
        ],
        [
            "Floral cup",
            "The floral configuration where a structure surrounds the ovary, and the other floral parts (sepals, petals, stamens) are attached to the rim of the floral cup"
        ],
        [
            "Flower",
            "A modified shoot often arising from axils, consisting of an axis that bears specialized appendages (e.g. sepals, petals, stamens, and pistils)"
        ],
        [
            "Foliage spray",
            "A fern-like growth of 2-ranked branchlets composed of pairs of overlapping scale leaves. When foliage is in flattened sprays, the scale leaves are arranged in overlapping pairs on 4 sides"
        ],
        [
            "Follicle",
            "An elongate dry fruit derived from a single simple ovary that opens on one side"
        ],
        [
            "Fruit",
            "The seed-bearing structure in angiosperms that is formed from the ovary after flowering"
        ],
        [
            "Glands",
            "Structures that produce oily or sugary secretions"
        ],
        [
            "Glaucous",
            "An adjective meaning to be covered with a greyish, bluish, or whitish waxy coating or bloom that is easily rubbed off"
        ],
        [
            "Hairs",
            "Small outgrowths of the epidermis, found on leaves, stems, and branches. Hairs are usually long and narrow, and can be straight, branched, or gland-tipped"
        ],
        [
            "Indehiscent dry fruits",
            "Dry fruits which do not split open"
        ],
        [
            "Inferior ovary",
            "The floral configuration where the ovary sits below the other floral parts (sepals, petals, and stamens), which are attached at the tip of the ovary"
        ],
        [
            "Inflorescence",
            "A cluster that bears many individual flowers on, or branching from, one or more common stalks"
        ],
        [
            "Internode",
            "The region between two nodes"
        ],
        [
            "Involucre",
            "The structure formed by whorls of bracts beneath a flower cluster"
        ],
        [
            "Keeled",
            "An adjective describing leaves that have a distinct, sharp angled edge fold along the midrib or in the bottom, resembling the keel of a boat"
        ],
        [
            "Lamina",
            "The leaf blade tissue, excluding vascular tissue"
        ],
        [
            "Lateral pair",
            "The pairs of leaves at right angles on either side of the facial pair in a flattened foliage spray"
        ],
        [
            "Lateral (secondary) veins",
            "Leaf veins which branch from the midrib"
        ],
        [
            "Leaf",
            "A flattened structure which serves as the main organ of photosynthesis and transpiration. All leaves have an axillary bud"
        ],
        [
            "Leaf scar",
            "The mark on a twig left by the shedding of a leaf, indicating where the previous year's leaf stalk was attached"
        ],
        [
            "Leaf shapes",
            "TODO: requires images"
        ],
        [
            "Leaflets",
            "The smaller blades making up a compound leaf. There are no buds at the base of a leaflet."
        ],
        [
            "Legume (pod)",
            "The characteristic flattened two-parted dehiscent dry fruit of the legume family which splits open at sutures along both edges"
        ],
        [
            "Lenticels",
            "One of many raised pores in the stem of a woody plant that enable gas exchange between the atmosphere and the twig"
        ],
        [
            "Locule",
            "A chamber within an ovary, anther, sporangium, or fruit. In ovaries and fruit, each locule usually corresponds to a carpel"
        ],
        [
            "Long shoots",
            "Main shoots that elongate between the nodes, becoming branches and trunks that contribute to the woody framework of a tree"
        ],
        [
            "Mesocarp",
            "The middle layer of the pericarp of a fruit, between the endocarp and the exocarp"
        ],
        [
            "Midrib / primary vein",
            "The primary, middle vein in a leaf"
        ],
        [
            "Monoecy (adj. monoecious)",
            "A sexual system in seed plants where separate male and female cones or flowers are present on the same plant"
        ],
        [
            "Multiple fruits",
            "Clusters of many individual, small, dry or fleshy fruits, each from a separate flower and often in ball-like heads"
        ],
        [
            "Nectaries",
            "Glands that secrete sugary liquids to attract insect pollinators; often found at the base of the stamens or on the inner rim of the floral cup"
        ],
        [
            "Needle",
            "A narrow, pointed leaf that may be borne in bundles or singly. Bundles are inserted above a non-photosynthetic scale leaf"
        ],
        [
            "Needle orientation and attitude",
            "The position of the needle relative to the branch. Needles may be curved or straight. They may lie in a flat plane, be angled upward, or project at right angles to the stem"
        ],
        [
            "Neoformed/late leaves",
            "Leaves that form on long shoots during the growing season"
        ],
        [
            "Node",
            "The site of leaf attachment, an axillary bud, and potentially a lateral branch"
        ],
        [
            "Nut",
            "A fairly large, dry, indehiscent fruit with a thick, bony ovary wall surrounding a single seed"
        ],
        [
            "Nut cup",
            "A cup-like sheath surrounding or enclosing some nuts, formed from involucral bracts"
        ],
        [
            "Nut husk",
            "An outer shell in some nuts formed from involucral bracts"
        ],
        [
            "Nutlet",
            "A small nut"
        ],
        [
            "Opposite leaves",
            "A leaf arrangement in which leaves are arranged in pairs, opposite to one another at the same node"
        ],
        [
            "Ovary",
            "The part of the pistil which holds the ovules. There are three possible positions of the ovary relative to other floral parts"
        ],
        [
            "Ovule",
            "The structure that gives rise to and contains the female reproductive cells, and which develops into seeds"
        ],
        [
            "Palmate compound leaves",
            "A type of compound leaf in which the leaflets all join in the same place at the leaf stalk"
        ],
        [
            "Palmate venation",
            "A type of leaf venation where the lateral veins all originate from the base of the leaf blade"
        ],
        [
            "Panicle",
            "A type of flower cluster in which branched groups of flowers are arranged along the primary axis; i.e., a branched raceme"
        ],
        [
            "Perianth",
            "The collective name for the calyx and corolla, the non-reproductive parts of the flower"
        ],
        [
            "Pericarp",
            "The part of the fruit formed from the wall of the ripened ovary"
        ],
        [
            "Petals",
            "The modified leaves that form an inner whorl surrounding the reproductive parts of flowers"
        ],
        [
            "Petaloid",
            "An adjective describing undifferentiated tepals when they resemble petals"
        ],
        [
            "Petiole",
            "The leaf stalk, containing vascular bundles that transport water and mineral nutrients"
        ],
        [
            "Photosynthesis",
            "The process of using sunlight to combine carbon dioxide and water to produce sugars and release oxygen"
        ],
        [
            "Pinnate compound leaves",
            "A type of compound leaf in which leaflets are arranged along a central stalk called the rachis"
        ],
        [
            "Pinnate venation",
            "A type of leaf venation where the lateral veins are arranged along the midvein"
        ],
        [
            "Pistil",
            "The female organs of the flower, each comprised of one or more laterally joined carpels with a single ovary"
        ],
        [
            "Pith",
            "A core of tissue inside the twig that is usually solid and continuous, but can be chambered, sectioned, or spongy"
        ],
        [
            "Pollen cone",
            "The male, pollen-producing reproductive structure in conifers"
        ],
        [
            "Pome",
            "A fleshy fruit from an inferior ovary of (usually) two to five carpels in which the innermost layer of the ovary wall is membranous in texture"
        ],
        [
            "Preformed/early leaves",
            "Leaves formed within a bud from the previous season"
        ],
        [
            "Prickles",
            "Sharp outgrowths or projections from the epidermis of a plant structure"
        ],
        [
            "Raceme",
            "A type of flower cluster in which stalked flowers are arranged along the primary axis"
        ],
        [
            "Rachilla (pl. rachillae)",
            "The branches of the rachis in twice or more pinnate leaves"
        ],
        [
            "Rachis",
            "An extension of the petiole which serves as the central stalk of a pinnate compound leaf."
        ],
        [
            "Samara",
            "A dry, indehiscent, winged fruit or fruit segment containing a single seed and adapted for wind dispersal, composed of a membranous wing and a seeded portion"
        ],
        [
            "Scales",
            "Small outgrowths of the epidermis, found on leaves, stems, and branches. Scales are flattened and broad,, often with a textured or flaky surface"
        ],
        [
            "Scale leaf",
            "Leaves with little or no expanded blade portion. Scales may have a gland or be keeled on the outer face"
        ],
        [
            "Seed cone",
            "The female, seed-producing reproductive structure in conifers. Seed cones have a central axis covered with bracts nestling seed scales"
        ],
        [
            "Seed scale",
            "Single or multiple structures axillary to a bract, protecting a seed"
        ],
        [
            "Sepals",
            "The modified leaves (usually green) which typically function as protection for the flower in bud and support for the petals when in bloom"
        ],
        [
            "Sessile",
            "An adjective describing leaves or leaflets lacking stalks"
        ],
        [
            "Shoots",
            "Axes together with their appendages"
        ],
        [
            "Simple leaves",
            "A type of broad leaf having a single continuous blade that is not divided. It may be smooth-edged, toothed, or lobed"
        ],
        [
            "Spike",
            "A type of flower cluster in which stalkless flowers are arranged along the primary axis"
        ],
        [
            "Spiral leaves",
            "A leaf arrangement in which leaves rotate around the stem, not in the same plane"
        ],
        [
            "Spur/short shoots",
            "Shoots that grow from year to year with little internodal elongation between the annual batches of closely spaced leaves"
        ],
        [
            "Stamens",
            "The male organs of flowers"
        ],
        [
            "Staminodes",
            "Non-functional stamens; i.e., ones which do not produce viable pollen. Staminodes may resemble stamens or be reduced to stubs"
        ],
        [
            "Sterigma",
            "A needle base modified into a woody peg"
        ],
        [
            "Stigma",
            "A sticky surface of the pistil where pollen is captured. Each branch of the stigma corresponds to a carpel"
        ],
        [
            "Stipular spines",
            "Sharp-pointed modified stipules"
        ],
        [
            "Stipule",
            "A small leaf-like appendage to a leaf, typically borne in pairs at the base of the leaf stalk. Stipules usually fall off before the rest of the leaf, often leaving distinct scars"
        ],
        [
            "Stipule scar",
            "The mark left by the stipule attached to the previous year's growth"
        ],
        [
            "Stomatal bands",
            "Lines of stomates arranged on either side of the midrib that appear as yellow or white stripes on the underside or upper surface of the needle"
        ],
        [
            "Stomates/stomata",
            "The breathing pores in the epidermis of all leaves that are used to exchange gases and reduce water loss"
        ],
        [
            "Stone",
            "A hard body found in certain fruits, produced by ossification of the endocarp or lining of the fruit"
        ],
        [
            "Style",
            "The part of the pistil which connects the stigma and the ovary"
        ],
        [
            "Superior ovary",
            "The floral configuration where the ovary sits above the other floral parts (sepals, petals, and stamens), which are attached at the base of the ovary"
        ],
        [
            "Tepals",
            "The collective name for the petals and sepals when they are difficult to distinguish"
        ],
        [
            "Terminal bud",
            "The bud enclosing the growing point of a shoot and its side branches"
        ],
        [
            "Thorns",
            "Short shoots that have been modified to have a hard, sharp point, and which may be simple or compound"
        ],
        [
            "Trunk/bole",
            "The main stem of a tree, which supports the branches and connects to the roots underground - the main axis from which subsidiary branches arise"
        ],
        [
            "Trunk shapes",
            "TODO: requires images"
        ],
        [
            "Umbel",
            "A type of flower cluster in which stalked flowers all originate from the same location and form an umbrella-like top"
        ],
        [
            "Unisexual flowers",
            "Flowers containing either exclusively male or exclusively female reproductive organs"
        ],
        [
            "Whorled leaves",
            "A leaf arrangement in which each node bears three or more leaves"
        ],
        [
            "Zygomorphic",
            "An adjective describing a bilaterally symmetrical flower; i.e., a flower with a single plane of symmetry"
        ]
    ]
}